{"data":{"site":{"siteMetadata":{"title":"The Minimum Town","author":"Zhang Yongchao"}},"markdownRemark":{"id":"3b9c8817-2b0a-5ddc-8982-789447e1855e","excerpt":"…","html":"<p>今天的《奇葩说》论点是：</p>\n<p align=\"center\"><b>“找一份高薪而不喜欢的工作，还是找一份低薪但却符合兴趣的工作？”</b></p>\n<p>选手们的辩论，精彩之处比比皆是。有过慷慨激昂的高呼，激起人们对“诗和远方”的遐想；也有歇斯底里的控诉，将人们拉回身不由己的现实。  </p>\n<p>然而，对节目内容连连称赞的同时，辩论过程中涉及的问题却仿佛一个又一个灵魂拷问般，此起彼伏的敲击着我们并不强大的内心。  </p>\n<p>高薪，不喜欢？站着挣钱？跪着挣钱？讨好现实，享受物质？<br>\n低薪，喜欢？诗和远方？消耗兴趣？丰满精神，焦于生活？  </p>\n<p>那么，回过头来想，我们真的选对工作了吗?\n我，真的选对工作了吗？  </p>\n<p>有言道：</p>\n<p align=\"center\">将兴趣作为工作，是最大的悲哀</p>\n<p>想必许多人都会有这样的担忧，也如前文提到的，这是一个消耗兴趣的过程。<br>\n兴趣是我们为数不多（与现实的约束相比，再丰富的兴趣也只可称为数不多）的不需要任何因素鞭挞，我们自己就欣然为之的事，是我们心海里的港湾，灵魂中的花朵。<br>\n我们怎么舍得彼岸一个个消失，花儿一株株枯萎呢？<br>\n这时候有一份高薪但不喜欢的工作摆在面前。<br>\n想想，什么工作不是工作？但保护兴趣很重要。并且高薪和低薪有质的差别，衡量下来，“高薪不喜欢”好像收益相当领先。  </p>\n<p>但转念一想，我们痴痴向往的兴趣爱好，往往不是我们能够赖以生存的东西——琴棋书画、诗文歌赋、攀山越岭、周游列国、体育运动、电影戏剧等等，哪一个领域不是绝大部分财富掌握在极少数人手中的，这个比例甚至比二八定理还要小得多。<br>\n突然有一天，这个（或某个）兴趣竟然能给你带来收入，支撑着你的生活需求，即便质量不太高，恐怕也会有好多人迫不及待的向落入这“美好”的乌托邦。现实与梦想交织在一起，这听起来是件任何人都巴不得的事情。  </p>\n<p>乍一看两种观点各有千秋，无论作出哪种选择，都是合情合理的。当然了，在节目里，这作为正反两方的观点，当然是要在逻辑上刀光剑影地决出胜负，好比拳击比赛没有击倒也要以点数判断胜负一样。\n但这只是一个指引，更重要的是启发我们的思考。</p>\n<p>其实小生是一个幸运儿。<br>\n作为一个在北京工作的程序员，属于高收入群体，姑且说是所谓的高薪吧；同时小生喜欢折腾，尝试各种技术，对技术的热枕亦是自有信心。<br>\n毫无疑问，属于“高薪又喜欢”。</p>\n<p>“呵，高薪又喜欢，何来资格谈论这个辩题？”  </p>\n<p>有那么一瞬间，我这样问自己，但随着节目的进度向前，我渐渐的想起了一些瞬间，好像——“高薪又喜欢？”——真的不是那么回事儿。  </p>\n<p>小生眼下在一个业务密度比较大的团队，尽管项目都不是很复杂，但需求通常是接踵而至，好多维护工作都是在实现新需求的过程中进行。这使得小生自我折腾的时间相比以前少了很多。<br>\n有一天，小生因为手上项目刚刚有了阶段性的了结，所以暂时空闲，于是开始搞事情。<br>\n目标是写一个 YouTube 视频的下载工具，当然只是练手，去接触一些没玩过的实践模式。但过程中遇到了一些众所周知的原因引起的问题，然后尝试将整个服务放到国外的服务器上，然而这个服务器是个几乎是个裸环境，需要从零安装各种各样的东西。<br>\n这套东西小生是基于 node 搭建的，而 node 的生态十分混乱，再加上环境是 centos 7，自带的各种模块都很旧，由此各种各样的兼容性问题就发生了。<br>\n折腾了快一下午，终于把服务 run 了起来。nice！<br>\n这时候我竟感觉到了一种久违的快乐，是一种相当过瘾的感觉。<br>\n相比平常解决业务代码中的问题或是开发各种新功能带来的成就感，这简直美妙上了十倍。  </p>\n<p>但小生不就是自称热爱技术吗？那么为什么同样是技术实践，能有这样的感觉差异呢？   </p>\n<p>放下诗歌，站在原地，小生不得不承认，在自己的心里，对技术的大部分热爱其实是存在于学习和折腾新东西上面；而在落地的项目中摸爬滚打，相对前者地位就低了很多，固然它们真的很重要。<br>\n然而做着自己不喜欢的事，是很容易加深惰性的，那些在得过且过和精益求精之间徘徊的片刻、那些在偷工减料和锦上添花之间纠结的时候，都告诉我，惰性，它在慢慢成长，即便我每次都选择了更严格的要求自己，但“选择”的出现，说明我已经有想退缩的冲动了。<br>\n如果这次折腾来得晚些，我是否会在哪个模块安装出问题的时候就放弃整个工程？<br>\n这样的折腾，不应该是偶然为之的。<br>\n当然，也不能天天都折腾，误工是一回事，飘在天上，学而无用又是一回事。\n因而要控制“喜欢”和“不喜欢”两个部分的交织节奏，保持新鲜感和好奇心，它们既是进步的源泉，又是激情的守护者。</p>\n<p>于是，结合今天的所得，小生认为：</p>\n<p align=\"center\"><b>将兴趣作为工作，其实是一个对自己的兴趣有更深认识的机会，如果你失控了，那么你的兴趣就会被不断消耗</b></p>\n<p>再想想眼下的世界，有多少人以育人为乐却并不爱与学生打交道？他们喜欢的是将自己的观点和学识表达和分享出来，但这并不是教育的全部；有多少人自诩热心管理却不谙经营之道？他们只是爱人前发号施令或是热血沸腾的画饼演说，但这作为管理者是失败的；有多少人自称痴迷阅读却不求甚解？他们有的是为了贩卖知识，好为人师，有的只是喜欢在人前炫耀，，亦或是增加谈资，这其实没错，但阅读本身并不是他们的兴趣，卖菜和吹牛才是。<br>\n这样例子数不胜数，在你我的周围就有许多。<br>\nIT 这一行尤为“猖獗”，在岸上觊觎着这神秘的世界，欣然一跃，入水却发现这渊不可测的海底世界难以深掘，只得在浅水处止步，任洋流将自己推来推去。<br>\n这些人，包括小生在内，开始工作的时候，在自己和别人看来，都是手握“高薪“且以兴趣为工作，但随着对兴趣认识的加深，或许就只能说是工作与兴趣的“一部分”结合了。<br>\n这时候还能说是在以兴趣为工作吗？不尽然，不成立。</p>\n<p>现在，卸下了“喜欢”这个设定。<br>\n再来想想“高薪”。<br>\n为什么能得到高薪？是因为领导层觉得你值得，需要你来担任这个职位，因而愿意为你提供这样一份薪水。<br>\n我们不是成天倡导要寻找人生的意义、实现个人价值吗？<br>\n人生的意义是难以衡量的，但个人价值，不是就直观地体现在了这个薪水上吗？你的价值如此，你便得到了相应的待遇，那么这对你来说是高薪吗？<br>\n尽管在不同地方，薪水还会有数值上的差异，但这与当地的消费水平一定是成正比的，其价值却是不变的，因此你拿到了怎样的工资，体现的都是你的价值，它是你应得的。<br>\n也许会有声音说道：“高薪这个概念是根据社会平均工资来比较的。”<br>\n尚且，眼下考虑这个问题的是你自己，不是这个社会，因为社会只对你有需求，无论你选择哪一种，你都是满足了社会的需求而已。同时，基于平均工资来看，大部分高薪的工作，都包含着风险和对应的消费压力，担负的责任也更大，权利与义务总是一致的。<br>\n反过来说“低薪”，薪水为什么低，也是因为你在做这个事情时的价值决定了这个数值，对于你来说这也不是低薪。</p>\n<p>那么现在的情况是：</p>\n<p align=\"center\"><b>高薪和低薪，体现的都是你应有的价值</b></p>\n<p>所以我们要选择的是：</p>\n<p align=\"center\"><b>我们应该要体现自己的哪一种价值？</b></p>\n<p>其实这个问题问错了，因为在这个设定下，选择实现哪一种价值，没有应该不应该，它是我们的权利。\n再想想前置的选项，是选择哪一种工作。\n我们的选择就成了：</p>\n<p align=\"center\"><b>我们应该要体现自己的哪一种需要长期付出的价值？</b></p>\n<p>然而，尽管我们都是披荆斩棘的杀出一条血路出来被捶，但这条血路来自何方是不同的；每个人有他可以实现的各种价值，也有他做选择题时的方式——反正没有人能定义正确答案，当然就要”由着性子“下决定。\n重要的是，一旦选择了，就要真正的为其付出，尽力追求在终点的终点，当之无愧或无怨无悔。</p>\n<p>不禁让人想起了汪国真《热爱生命》一诗的开头：</p>\n<blockquote>\n<p>既然选择了远方，便只顾风雨兼程</p>\n</blockquote>\n<p>人生就是一首诗；无论选择哪一个方向，都是选择了远方。<br>\n往哪里走，都能到远方，完成你自己的诗。但你要走，你要去，踏步如走笔，奔跑如绘卷。 </p>\n<p>我想，这是这个论题想要启发我们领悟的一点。</p>\n<p>我找对工作了吗？\n现在我对自己说：“我选择了这份工作，这份工作也落到了我头上，说明我应当值得，于是，我若能在往后不断体现自己的这份价值，我便是选对了。对与不对，不体现在开头，而彰显在过程。”</p>\n<p>最后，以一首美国诗人的作品节选来勉励吧，毕竟那些年美国不遗余力的开拓精神，影响了全世界：</p>\n<p align=\"center\">\n<b>Roll the Dice (Excerpt)</b>\nIf you are going to try, go all the way.<br>\nIt could mean derision,mockery, isolation.<br>\nIsolation is the gift,<br>\nAll the others are a test of your endurance, <br>\nof how much you really want todo it.<br>\nAnd you’ll do it.<br>\ndespite rejection and the worst odds<br>\nand it will be better than anything else you can imagine.<br>\nIf you’re going to try, go all the way.<br>\n</p>","frontmatter":{"title":"拾穗——选对工作了吗","date":"October 12, 2018","tags":["拾穗","阅读"],"type":"tech"}}},"pageContext":{"slug":"/2018-10-12--拾穗——找对工作了吗/","previous":{"fields":{"slug":"/2018-10-11--新知-可视化思维/"},"frontmatter":{"title":"新知——可视化思维"}},"next":null}}